let spiderData = [
    {
        name: 'Терафозид (Theraphosa)',
        eat: 'Таргани, великі цвіркуни, миші та деякі безхребетні',
        area: "Південна Америка",
        facts: ['Це одні з найбільших павуків у світі за масою та розміром тіла',
            'Можуть шипіти у разі небезпеки',
            'Вага дорорслих особин може перевищувати 170 грамів'],
        size: 'Довжина може сягати до 30см',
        image: 'spider-1.jpg',
    },
    {
        name: 'Павук-краб (Thomisidae)',
        eat: 'Комахи: мухи, метелики, дрібні жуки та інші дрібні комахи',
        area: "Весь світ окрім Антарктиди",
        facts: ['Вони дуже швидкі',
            'Вони дуже добре маскуються не гірше хамелеонів',
            'сильні передні лапи'],
        size: 'Довжина може сягати до 2см',
        image: 'spider -2.jpg',
    },
    {
        name: 'Павук-скакун (Salticidae)',
        eat: 'Мухи, комарі, попелиці, личинки комах та дрібних жуків',
        area: "Весь світ окрім Антарктиди",
        facts: ['Це одні з найменших павуків у світі за масою та розміром тіла',
            'Високо пригають',
            'Мають дуже гарний зір'],
        size: 'Довжина може сягати до 18мм',
        image: 'spider - 3.jpg',
    },
    {
        name: 'Золотий паук - ткач (Nephila clavipes)',
        eat: 'Мухи, комарі, метелики, бабки, сарана та коники',
        area: "Теплі регіони Америки ",
        facts: ['Мають міцну павутину',
            'Не роблять нову павутину а її покращують',
            'Не міняють місце знаходження з народження, роблять це дуже рідко'],
        size: 'Довжина може сягати до 10см',
        image: 'spider - 5.webp',
    },
  {
        name: 'Павук - бородавочник (Deinopis spinosa)',
        eat: 'Мухи, комарі, метелики,таргани, мурахи та цвіркунів',
        area: "Теплі регіони Америки та Австралія ",
        facts: ['маскуються під гілку',
            'має нічний суперзір',
            'Ловить сіткою - пасткою'],
        size: 'Довжина може сягати до 13мм',
        image: 'spider - 6.jpg',
    },
      {
        name: 'Павук - павич (Maratus volans)',
        eat: 'Мухи, комарі, метелики, оси, кліщі',
        area: "Австралія ",
        facts: ['Самці яскраво забарвлені та танцюють',
            'Мають чудовий зір для полювання ',
            'Живуть лише в деяких регіонах Австралії'],
        size: 'Довжина може сягати до 5мм',
        image: 'spider - 7.jpg',
    },
      {
        name: 'Водяні павуки (Argyroneta aquatica)',
        eat: ', пуголовки , водяні кліщі, дрібних ракоподібних, водяні комахи та їхні личинки',
        area: "Євразія ",
        facts: ['Самці більші за самок',
            'Будують повітряний дзвін',
            'мігрують майже завжди'],
        size: 'Довжина може сягати до 15мм',
        image: 'spider - 8.jpg',
    },


 {
        name: 'Аргіопа тигрова (Argiope trifasciata)',
        eat: 'Мухи, комарі, метелики, бабки, сарана та коники',
        area: "Євразія, Північна Африка ",
        facts: ['Яскраве смугасте забарвлення',
            'Плете зигзаг',
            'Самки набагато більші за самців'],
        size: 'Довжина може сягати до 2см',
        image: 'spider - 9.jpg',
    },


]

let spiderApp = {
    data() {
        return {
            spiders: spiderData,
            currentSpider: spiderData[0],
            currentIndex: 0,
        }
    },
    methods: {
        showSpider(index) {
            this.currentSpider = spiderData[index];
            this.currentIndex = index;
        }
    },
}
Vue.createApp(spiderApp).mount('#vue-cont')